/* Used when showing an invalid entry or input encountered when expecting a formal entry such as a number of date */
"\\U201c%@\\U201d" = "“%@”";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C" = "ค่าไม่ถูกต้อง";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C.a" = "ค่า %@ ไม่ถูกต้อง";

/* NSKeyValueValidationError, suggestion string when a numeric value of an user input is invalid (for example too small or too large) */
"Err1024-R" = "โปรดให้ค่าที่ถูกต้อง";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C" = "ค่าไม่ถูกต้อง";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C.a" = "ค่า %@ ไม่ถูกต้อง";

/* NSFormattingError, message shown when the numeric value of an entry or input is too small */
"Err2048-C.an" = "ค่าเล็กเกินไป";

/* NSFormattingError, message shown when the numeric value of an entry or input is too large */
"Err2048-C.ax" = "ค่าใหญ่เกินไป";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-R" = "โปรดให้ค่าที่ถูกต้อง";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small */
"Err2048-R.n" = "โปรดให้ตัวเลขไม่ต่ำกว่า %@";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small or too large */
"Err2048-R.nx" = "โปรดให้ตัวเลขระหว่าง %1$@ กับ %2$@";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too large */
"Err2048-R.x" = "โปรดให้ตัวเลขไม่เกิน %@";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.an" = "ค่า %@ เล็กเกินไป";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.ax" = "ค่า %@ ใหญ่เกินไป";

/* NSFileLockingError */
"Err255-C" = "ไฟล์ล็อกไม่ได้";

/* NSFileLockingError */
"Err255-R" = "ไฟล์อาจล็อกอยู่แล้ว หรือคุณไม่ได้รับสิทธิ์ให้ล็อกไฟล์";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "ไฟล์ “%@” ล็อกไม่ได้";

/* NSFileReadUnknownError */
"Err256" = "ไฟล์เปิดไม่ได้";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "ไฟล์ “%@” เปิดไม่ได้";

/* NSFileReadNoPermissionError */
"Err257" = "ไฟล์เปิดไม่ได้เนื่องจากคุณไม่ได้รับสิทธิ์ให้ดู";

/* NSFileReadNoPermissionError */
"Err257-C" = "คุณไม่ได้รับสิทธิ์";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "ในการดูหรือเปลี่ยนสิทธิ์ เลือกรายการใน Finder แล้วเลือกไฟล์ > เรียกค้นข้อมูล";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "ไฟล์ “%@” เปิดไม่ได้ เนื่องจากคุณไม่ได้รับสิทธิ์ให้ดู";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "ชื่อไฟล์ไม่ถูกต้อง";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "รายการเปิดไม่ได้เนื่องจากชื่อไฟล์ “%@” ไม่ถูกต้อง";

/* NSFileReadCorruptFileError */
"Err259" = "ไฟล์เปิดไม่ได้เนื่องจากรูปแบบไฟล์ไม่ถูกต้อง";

/* NSFileReadCorruptFileError */
"Err259-C" = "รูปแบบไฟล์ไม่ถูกต้อง";

/* NSFileReadCorruptFileError */
"Err259-R" = "ไฟล์อาจเสียหาย ตัดขาด หรืออยู่ในรูปแบบที่ไม่ได้คาดไว้";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "ไฟล์ “%@” เปิดไม่ได้ เนื่องจากรูปแบบไฟล์ไม่ถูกต้อง";

/* NSFileReadNoSuchFileError */
"Err260" = "ไฟล์เปิดไม่ได้เนื่องจากไฟล์ไม่มีอยู่";

/* NSFileReadNoSuchFileError */
"Err260(Folder).f" = "โฟลเดอร์ “%@” ไม่มีอยู่";

/* NSFileReadNoSuchFileError */
"Err260-C" = "ไฟล์ไม่มีอยู่";

/* NSFileReadNoSuchFileError */
"Err260-C(Folder)" = "โฟลเดอร์ไม่มีอยู่";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "ไฟล์ “%@” เปิดไม่ได้ เนื่องจากไม่มีไฟล์นั้น";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "ไฟล์เปิดโดยใช้รหัสอักขระที่กำหนดไม่ได้";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "รหัสอักขระที่ระบุใช้งานไม่ได้";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "รหัสอักขระ %@ ใช้งานไม่ได้";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "ไฟล์อาจได้บันทึกโดยใช้รหัสอักขระต่างไป หรืออาจไม่ใช่ไฟล์ข้อความ";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "ไฟล์เปิดโดยใช้รหัสอักขระ %@ ไม่ได้";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "ไฟล์ “%2$@” เปิดโดยใช้รหัสอักขระ %1$@ ไม่ได้";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "ไฟล์เปิดไม่ได้เนื่องจากประเภทของ URL ไม่รองรับ";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "ประเภทของ URL ที่ระบุไม่รองรับ";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "ไฟล์ “%1$@” เปิดไม่ได้ เนื่องจากประเภท %2$@ ของ URL ไม่รองรับ";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "ไฟล์เปิดไม่ได้เนื่องจากประเภท %@ ของ URL ไม่รองรับ";

/* NSFileReadTooLargeError */
"Err263" = "รายการเปิดไม่ได้เนื่องจากขนาดใหญ่เกินไป";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "รายการขนาดใหญ่เกินไป";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "รายการ “%@” เปิดไม่ได้เนื่องจากขนาดใหญ่เกินไป";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "ไฟล์เปิดไม่ได้เนื่องจากไม่สามารถระบุรหัสอักขระของเนื้อหา";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "ไม่สามารถระบุถึงการเข้ารหัสข้อความของเนื้อหา";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "คุณอาจเปิดไฟล์ได้โดยระบุรหัสอักขระของเนื้อหา";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "ไฟล์ “%@” เปิดไม่ได้ เนื่องจากไม่สามารถระบุรหัสอักขระของเนื้อหา";

/* NSUserCancelledError */
"Err3072-C" = "การทำงานยกเลิก";

/* NSFeatureUnsupportedError */
"Err3328" = "การทำงานที่ขอไม่สำเร็จเนื่องจากคุณสมบัติไม่รองรับ";

/* NSFeatureUnsupportedError, argument is a file name */
"Err3328(Trash).f" = "ย้าย “%@” ไปที่ถังขยะไม่ได้ เนื่องจากดิสก์โวลุ่มไม่มีถังขยะ";

/* NSFeatureUnsupportedError, argument is a file name and volume name */
"Err3328(Trash).fv" = "ย้าย “%1$@” ไปที่ถังขยะไม่ได้ เนื่องจากดิสก์โวลุ่ม “%2$@” ไม่มีถังขยะ";

/* NSFeatureUnsupportedError */
"Err3328-C" = "การทำงานที่ขอไม่รองรับ";

/* NSFeatureUnsupportedError */
"Err3328-C(Trash)" = "ดิสก์โวลุ่มไม่มีถังขยะ";

/* NSPropertyListCorruptError */
"Err3840" = "ข้อมูลอ่านไม่ได้เนื่องจากข้อมูลเสียหาย";

/* NSPropertyListCorruptError */
"Err3840-C" = "ข้อมูลเสียหาย";

/* NSPropertyListUnknownVersionError */
"Err3841" = "ข้อมูลอ่านไม่ได้เนื่องจากข้อมูลอยู่ในรูปแบบที่แอปพลิเคชั่นไม่เข้าใจ";

/* NSPropertyListUnknownVersionError */
"Err3841-C" = "ข้อมูลอยู่ในรูปแบบที่แอปพลิเคชั่นไม่เข้าใจ";

/* NSPropertyListReadStreamError */
"Err3842" = "ข้อมูลอ่านไม่ได้เนื่องจากข้อผิดพลาดในแหล่งข้อมูล";

/* NSPropertyListReadStreamError */
"Err3842-C" = "ข้อผิดพลาดเกิดขึ้นในแหล่งข้อมูล";

/* NSPropertyListWriteStreamError */
"Err3851" = "ข้อมูลเขียนไม่ได้เนื่องจากข้อผิดพลาดปลายทางสำหรับข้อมูล";

/* NSPropertyListWriteStreamError */
"Err3851-C" = "ข้อผิดพลาดเกิดขึ้นที่ปลายทางสำหรับข้อมูล";

/* NSFileNoSuchFileError, argument is a folder name */
"Err4(Folder).f" = "โฟลเดอร์ “%@” ไม่มีอยู่";

/* NSFileNoSuchFileError, first arg: source file, second arg: destination file */
"Err4(Move).fp" = "ย้าย “%1$@” ไปที่ “%2$@” ไม่ได้ เนื่องจากไม่มีรายการย้าย หรือไม่มีโฟลเดอร์ที่จะใส่รายการย้ายนั้น";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "ลบ “%@” ไม่ได้";

/* NSFileNoSuchFileError */
"Err4-C" = "ไฟล์ไม่มีอยู่";

/* NSFileNoSuchFileError, applied to a folder */
"Err4-C(Folder)" = "โฟลเดอร์ไม่มีอยู่";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "ไฟล์ “%@” ไม่มีอยู่";

/* Message shown when the connection to a helper application is interrupted due to the helper application exiting. */
"Err4097" = "ไม่สามารถสื่อสารกับแอปพลิเคชั่นวิธีใช้";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4097-R" = "ลองการทำงานของคุณอีกครั้ง ถ้ายังไม่สำเร็จ ให้ออกจากแอปพลิเคชั่นและเปิดใช้ใหม่ แล้วลองอีกครั้ง";

/* Message shown when the connection to a helper application is interrupted and can not be reestablished. */
"Err4099" = "ไม่สามารถสื่อสารกับแอปพลิเคชั่นวิธีใช้";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4099-R" = "ลองการทำงานของคุณอีกครั้ง ถ้ายังไม่สำเร็จ ให้ออกจากแอปพลิเคชั่นและเปิดใช้ใหม่ แล้วลองอีกครั้ง";

/* Message shown when the connection to a helper application is invalidated due to a corrupted response. */
"Err4101" = "ไม่สามารถสื่อสารกับแอปพลิเคชั่นวิธีใช้";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4101-R" = "ลองการทำงานของคุณอีกครั้ง ถ้ายังไม่สำเร็จ ให้ออกจากแอปพลิเคชั่นและเปิดใช้ใหม่ แล้วลองอีกครั้ง";

/* NSFileWriteUnknownError */
"Err512" = "ไฟล์บันทึกไม่ได้";

/* NSFileWriteUnknownError, when the save of the specified file fails because the backup file for the saved file can't be created or updated */
"Err512(Backup).f" = "ไฟล์ “%1$@” บันทึกไม่ได้ เนื่องจากไฟล์ข้อมูลสำรองอัปเดตไม่ได้";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "คัดลอก “%1$@” ไปที่ “%2$@” ไม่ได้";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "เชื่อมโยง “%1$@” ไปที่ “%2$@” ไม่ได้";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "ย้าย “%1$@” ไปที่ “%2$@” ไม่ได้";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "ลบ “%@” ไม่ได้";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Trash).f" = "ย้าย “%@” ไปที่ถังขยะไม่ได้";

/* NSFileWriteUnknownError, when the save of a file fails because the backup file can't be created or updated */
"Err512-C(Backup)" = "ไฟล์ข้อมูลสำรองบันทึกไม่ได้";

/* NSFileWriteUnknownError, recovery suggestion for when the save of a file fails because the backup file can't be created or updated */
"Err512-R(Backup)" = "ไฟล์ข้อมูลสำรองอาจล็อกอยู่ หรือคุณอาจไม่ได้รับสิทธิ์ให้บันทึก ในการดูหรือเปลี่ยนสิทธิ์ เลือกรายการใน Finder และเลือกไฟล์ > เรียกค้นข้อมูล";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "ไฟล์ “%2$@” บันทึกลงในโฟลเดอร์ “%1$@” ไม่ได้";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "ไฟล์ “%@” บันทึกไม่ได้";

/* NSFileWriteNoPermissionError */
"Err513" = "ไฟล์บันทึกไม่ได้เนื่องจากคุณไม่ได้รับสิทธิ์ให้ดู";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "คัดลอก “%1$@” ไม่ได้ เนื่องจากคุณไม่ได้รับสิทธิ์ให้เข้าถึง “%2$@”";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "เชื่อมโยง “%1$@” ไม่ได้ เนื่องจากคุณไม่ได้รับสิทธิ์ให้เข้าถึง “%2$@”";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "ย้าย “%1$@” ไม่ได้ เนื่องจากคุณไม่ได้รับสิทธิ์ให้เข้าถึง “%2$@”";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "ลบ “%@” ไม่ได้ เนื่องจากคุณไม่ได้รับสิทธิ์ให้เข้าถึง";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Trash).f" = "ย้าย “%@” ไปที่ถังขยะไม่ได้ เนื่องจากคุณไม่ได้รับสิทธิ์ให้เข้าถึง";

/* NSFileWriteNoPermissionError */
"Err513-C" = "คุณไม่ได้รับสิทธิ์";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "ในการดูหรือเปลี่ยนสิทธิ์ เลือกรายการใน Finder แล้วเลือกไฟล์ > เรียกค้นข้อมูล";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "คุณไม่ได้รับสิทธิ์ให้บันทึกไฟล์ “%2$@” ในโฟลเดอร์ “%1$@”";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "คุณไม่ได้รับสิทธิ์ให้บันทึกไฟล์ “%@”";

/* NSFileWriteInvalidFileNameError */
"Err514" = "รายการบันทึกไม่ได้เนื่องจากชื่อไฟล์ไม่ถูกต้อง";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "รายการลบไม่ได้เนื่องจากชื่อไฟล์ “%@” ไม่ถูกต้อง";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "ชื่อไฟล์ไม่ถูกต้อง";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "รายการบันทึกไม่ได้เนื่องจากชื่อไฟล์ “%@” ไม่ถูกต้อง";

/* NSFileWriteFileExistsError */
"Err516" = "ไฟล์บันทึกไม่ได้เนื่องจากไฟล์ชื่อเดียวกันมีอยู่แล้ว";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Copy).fp" = "คัดลอก “%1$@” ไปที่ “%2$@” ไม่ได้ เนื่องจากรายการชื่อเดียวกันมีอยู่แล้ว";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Link).fp" = "เชื่อมโยง “%1$@” ไปที่ “%2$@” ไม่ได้ เนื่องจากรายการชื่อเดียวกันมีอยู่แล้ว";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Move).fp" = "ย้าย “%1$@” ไปที่ “%2$@” ไม่ได้ เนื่องจากรายการชื่อเดียวกันมีอยู่แล้ว";

/* NSFileWriteFileExistsError */
"Err516-C" = "ไฟล์ชื่อเดียวกันมีอยู่แล้ว";

/* NSFileWriteFileExistsError, argument is a file name */
"Err516-C.f" = "ไฟล์ชื่อ “%@” มีอยู่แล้ว";

/* NSFileWriteFileExistsError */
"Err516-R" = "ในการบันทึกไฟล์ ให้เปลี่ยนเป็นชื่ออื่น หรือย้ายไฟล์ชื่อนั้นออกไปที่อื่น หรือลบไฟล์ที่มีอยู่นั้น แล้วลองอีกครั้ง";

/* NSFileWriteFileExistsError, first arg: destination folder, second arg: a file name */
"Err516.df" = "ไฟล์ “%2$@” บันทึกลงในโฟล์เดอร์ “%1$@” ไม่ได้ เนื่องจากไฟล์ชื่อเดียวกันมีอยู่แล้ว";

/* NSFileWriteFileExistsError, argument is a file name */
"Err516.f" = "ไฟล์ “%@” บันทึกไม่ได้ เนื่องจากไฟล์ชื่อเดียวกันมีอยู่แล้ว";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "ไฟล์บันทึกโดยใช้รหัสอักขระที่กำหนดไม่ได้";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "รหัสอักขระที่ระบุใช้งานไม่ได้";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "รหัสอักขระ %@ ใช้งานไม่ได้";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "หากเป็นไปได้โปรดเลือกรหัสอักขระอื่น";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "ไฟล์บันทึกโดยใช้รหัสอักขระ %@ ไม่ได้";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "ไฟล์ “%2$@” บันทึกโดยใช้รหัสอักขระ %1$@ ไม่ได้";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "ไฟล์บันทึกไม่ได้เนื่องจากประเภทของ URL ไม่รองรับ";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "ประเภทของ URL ที่ระบุไม่รองรับ";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "ไฟล์ “%1$@” บันทึกไม่ได้ เนื่องจากประเภท %2$@ ของ URL ไม่รองรับ";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "ไฟล์บันทึกไม่ได้เนื่องจากประเภท %@ ของ URL ไม่รองรับ";

/* NSFileWriteOutOfSpaceError */
"Err640" = "ไฟล์บันทึกไม่ได้เนื่องจากเนื้อที่ไม่เพียงพอ";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "คัดลอก “%1$@” ไปที่ “%2$@” ไม่ได้ เนื่องจากเนื้อที่ไม่เพียงพอ";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "เชื่อมโยง “%1$@” ไปที่ “%2$@” ไม่ได้ เนื่องจากเนื้อที่ไม่เพียงพอ";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "ย้าย “%1$@” ไปที่ “%2$@” ไม่ได้ เนื่องจากเนื้อที่ไม่เพียงพอ";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640(Trash).f" = "ย้าย “%@” ไปที่ถังขยะไม่ได้ เนื่องจากเนื้อที่ว่างไม่เพียงพอ";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "ไม่มีเนื้อที่เพียงพอ";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "เนื้อที่ดิสก์โวลุ่ม “%@” ไม่เพียงพอ";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "ลบไฟล์บางส่วนออกจากดิสก์โวลุ่ม แล้วลองอีกครั้ง";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "คุณไม่สามารถบันทึกไฟล์ “%@” เนื่องจากเนื้อที่ไม่เพียงพอ";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "คุณไม่สามารถบันทึกไฟล์ “%1$@” เนื่องจากเนื้อที่ดิสก์โวลุ่ม “%2$@” ไม่เพียงพอ";

/* NSFileWriteVolumeReadOnlyError */
"Err642" = "ไฟล์บันทึกไม่ได้เนื่องจากดิสก์โวลุ่มอ่านได้อย่างเดียว";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642(Trash).f" = "ย้าย “%@” ไปที่ถังขยะไม่ได้ เนื่องจากดิสก์โวลุ่มอ่านได้อย่างเดียว";

/* NSFileWriteVolumeReadOnlyError */
"Err642-C" = "ดิสก์โวลุ่มอ่านได้อย่างเดียว";

/* NSFileWriteVolumeReadOnlyError, argument is volume name */
"Err642-C.v" = "ดิสก์โวลุ่ม “%@” อ่านได้อย่างเดียว";

/* NSFileWriteVolumeReadOnlyError */
"Err642-R" = "ลองบันทึกไฟล์ในดิสก์โวลุ่มอื่น";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642.f" = "คุณไม่สามารถบันทึกไฟล์ “%@” เนื่องจากดิสก์โวลุ่มอ่านได้อย่างเดียว";

/* NSFileWriteVolumeReadOnlyError, arguments are file name and volume name */
"Err642.fv" = "คุณไม่สามารถบันทึกไฟล์ “%1$@” เนื่องจากดิสก์โวลุ่ม “%2$@” อ่านได้อย่างเดียว";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"The operation couldn\\U2019t be completed. (%1$@ error %2$ld.)" = "การทำงานไม่เสร็จ (ข้อผิดพลาด %1$@ %2$ld)";

